app/controllers/user_items_controller.rb

	def create
	  # user = User.find_by(params[:token])
	  # p params[:user_items][:item_id].to_i
	  # checked the route from add button and working fine.

    # itemPressed = params[:item][:name]
    itemName = params[:item][:name]
    item = Item.find_by(name: itemName)
	  userItem = UserItem.new
    userItem.user_id = User.first.id
    userItem.item_id = item.id
    userItem.save
---
SELECT  "items".* FROM "items" WHERE "items"."name" = $1 LIMIT $2  [["name", "Pizza Rising Crust Four Cheese"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "user_items" ("user_id", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["item_id", 1], ["created_at", "2017-10-01 19:53:41.155648"], ["updated_at", "2017-10-01 19:53:41.155648"]]